{
  "nodes": [
    {
      "op": "null", 
      "name": "data3", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nxt_fc_weight", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "nxt_fc", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "32"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm13_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm13", 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 1], [12, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu10", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nxt_fc_1_weight", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "nxt_fc_1", 
      "attrs": {
        "no_bias": "True", 
        "num_hidden": "32"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm14_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm14", 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 1], [20, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu11", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "workspace": "512"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu0", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0], [41, 0, 1], [42, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu1", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(4, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(4, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 1], [50, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu2", 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 1], [58, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu3", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu4", 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu5", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu6", 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attrs": {
        "eps": "2e-05", 
        "momentum": "0.9"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm10_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm10", 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu7", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[87, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm11_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm11", 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 1], [111, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu8", 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attrs": {"num_hidden": "32"}, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm12_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm12", 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "relu9", 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "full_feature", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[22, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_mean", 
      "attrs": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm15_moving_var", 
      "attrs": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm15", 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "relu", 
      "name": "fc3_relu", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_weight", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4", 
      "attrs": {"num_hidden": "5"}, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "latency", 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[135, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater0", 
      "inputs": [[137, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul1", 
      "inputs": [[142, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[142, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus1", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square1", 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[141, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss0", 
      "attrs": {"normalization": "batch"}, 
      "inputs": [[150, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    4, 
    7, 
    9, 
    10, 
    11, 
    12, 
    15, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    27, 
    29, 
    31, 
    32, 
    33, 
    34, 
    37, 
    39, 
    40, 
    41, 
    42, 
    45, 
    47, 
    48, 
    49, 
    50, 
    53, 
    55, 
    56, 
    57, 
    58, 
    61, 
    63, 
    64, 
    65, 
    66, 
    69, 
    71, 
    72, 
    73, 
    74, 
    79, 
    80, 
    82, 
    83, 
    84, 
    85, 
    88, 
    89, 
    90, 
    91, 
    92, 
    95, 
    96, 
    98, 
    99, 
    100, 
    101, 
    105, 
    106, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    117, 
    118, 
    119, 
    120, 
    124, 
    125, 
    127, 
    128, 
    129, 
    130, 
    133, 
    134, 
    137
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184
  ], 
  "heads": [[136, 0, 0], [151, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10501]}
}